<template>
  <q-card flat style="max-width: 100%;">
    <q-card-section>
      <h1>オプション項目</h1>
      <!-- <h2>ワールドのリセット</h2>
      <p>
        同じ名前のワールドを新しく作り直す場合、ワールドのリセットができます。
        以下の画像のように、メイン画面にあるRecreate Worldのチェックボックスを入れてください。
        また、前のワールドを保存する場合はその下のSave Worldのチェックボックスも入れてください。
        同じシード値のワールドにはならないのでお気を付けください
      </p>
      <img alt="reset world" src="../../assets/MainWindow/Reset.png" style="height: 4cm;"/> -->

      <h2>データの削除</h2>
      <p>
        同じ名前のワールドを再生成するのではなく、ワールドを削除してしまうこともできます。
        メイン画面にてバージョンやワールドの選択を行う欄の横にゴミ箱ボタン
        <q-img alt="delete button" src="../../assets/MainWindow/delete1.png" width="1.4em"/>
        があります。
        削除したいバージョンやワールドを選択したうえでこのボタンを押すことで、データを削除することができます。
      </p>
      <q-img alt="delete window" src="../../assets/MainWindow/delete2.png" width="calc(100% - 5em)"/>


      <h2>OP権限の付与</h2>
      <p>
        サーバーを起動した際にコマンドを使いたい時など、自身にOP権限を付与したい場面は多いと思います。
        以下の画像のように、メイン画面の~~ has op rightsのチェックボックスを入れることで、サーバーを起動した人には自動でOP権限を付与することができます。
        この際、付与する権限レベルは最高の4になり、ほかの参加者に自動的にOP権限を付与するわけではありません。
        他の参加者にもOP権限を付与する場合は，「ワールド設定」の「Op権限」タブにて付与してください．
      </p>
      <q-img alt="op check" src="../../assets/MainWindow/op.png"/>

      <h2>自動シャットダウン</h2>
      <p>
        サーバーを起動した人が先にゲームから抜けてしまい、参加者が全員抜けた後もPCがつけっぱなしになってしまうことがあると思います。
        以下の画像のように、メイン画面のShutdown this PCのチェックボックスを入れておくことで、サーバーが停止した後にPCを自動でシャットダウンします。
        サーバーを停止する必要はあるため、最後に抜ける人（Op権限4を持つ人）にゲーム内で/stopのコマンドを打ってもらう必要があります。
        なお、シャットダウンする前に確認のダイアログが表示されるため、サーバー終了後にシャットダウンしないことも選択できます。
      </p>
      <q-img alt="shutdown" src="../../assets/MainWindow/shutdown.png"/>

    </q-card-section>
  </q-card>
</template>