<template>
  <q-card flat style="max-width: 100%;">
    <q-card-section>
      <h1>利用規約</h1>
      <!-- TODO: 1. か（１）表記の違いを原本に準拠させる -->
      <p>
        この規約は、お客様が、CivilTT（以下「作者」）が提供するServerStarter（以下「本ソフトウェア」）をご利用頂く際の取扱いにつき定めるものです。本規約に同意した上で本ソフトウェアをご利用ください。
      </p>

      <h2>第１条（定義）</h2>
      <p>
        本規約上で使用する用語の定義は、次に掲げるとおりとします。
      </p>
      <ol>
        <li>本ソフトウェア	作者が運営するサービス及び関連するサービス</li>
        <li>本サイト	本ソフトウェアのコンテンツが掲載されたウェブサイト</li>
        <li>本コンテンツ		本ソフトウェア上で提供される文字、音、静止画、動画、ソフトウェアプログラム、コード等の総称（投稿情報を含む）</li>
        <li>利用者	本ソフトウェアを利用する全ての方</li>
        <li>個人情報	住所、氏名、職業、電話番号等個人を特定することのできる情報の総称</li>
        <li>知的財産	発明、考案、植物の新品種、意匠、著作物その他の人間の創造的活動により生み出されるもの（発見または解明がされた自然の法則または現象であって、産業上の利用可能性があるものを含む）、商標、商号その他事業活動に用いられる商品または役務を表示するもの及び営業秘密その他の事業活動に有用な技術上または営業上の情報</li>
      </ol>

      <h2>第２条（本規約への同意）</h2>
      <ol>
        <li>利用者は、本利用規約に同意頂いた上で、本ソフトウェアを利用できるものとします。</li>
        <li>利用者が、本ソフトウェアをデスクトップPCその他の情報端末にダウンロードし、本規約への同意手続を行った時点で、利用者と作者との間で、本規約の諸規定に従った利用契約が成立するものとします。</li>
        <li>利用者が未成年者である場合には、親権者その他の法定代理人の同意を得たうえで、本ソフトウェアをご利用ください。</li>
        <li>未成年者の利用者が、法定代理人の同意がないにもかかわらず同意があると偽りまたは年齢について成年と偽って本ソフトウェアを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合、本ソフトウェアに関する一切の法律行為を取り消すことは出来ません。</li>
        <li>本規約の同意時に未成年であった利用者が成年に達した後に本ソフトウェアを利用した場合、当該利用者は本ソフトウェアに関する一切の法律行為を追認したものとみなされます。</li>
      </ol>

      <h2>第３条（規約の変更）</h2>
      <ol>
        <li>作者は、利用者の承諾を得ることなく、いつでも、本規約の内容を改定することができるものとし、利用者はこれを異議なく承諾するものとします。</li>
        <li>作者は、本規約を改定するときは、その内容について本サイトを通じて利用者に通知します。</li>
        <li>前本規約の改定の効力は、作者が前項により通知を行った時点から生じるものとします。</li>
        <li>利用者は、本規約変更後、本ソフトウェアを利用した時点で、変更後の本利用規約に異議なく同意したものとみなされます。</li>
      </ol>

      <h2>第４条（禁止行為）</h2>
      <p>
        本ソフトウェアの利用に際し、作者は、利用者に対し、次に掲げる行為を禁止します。作者において、利用者が禁止事項に違反したと認めた場合、利用者用の一時停止、退会処分その他作者が必要と判断した措置を取ることができます。 
      </p>

      <ol>
        <li>作者または第三者の知的財産権を侵害する行為</li>
        <li>作者または第三者の名誉・信用を毀損または不当に差別もしくは誹謗中傷する行為</li>
        <li>作者または第三者の財産を侵害する行為、または侵害する恐れのある行為</li>
        <li>作者または第三者に経済的損害を与える行為</li>
        <li>作者または第三者に対する脅迫的な行為</li>
        <li>コンピューターウィルス、有害なプログラムを仕様またはそれを誘発する行為</li>
        <li>本ソフトウェア用インフラ設備に対して過度な負担となるストレスをかける行為</li>
        <li>当サイトのサーバーやシステム、セキュリティへの攻撃</li>
        <li>作者提供のインターフェース以外の方法で作者サービスにアクセスを試みる行為</li>
        <li>上記の他、作者が不適切と判断する行為</li>
      </ol>

      <h2>第５条（免責）</h2>
      <ol>
        <li>作者は、本ソフトウェアの内容変更、中断、終了によって生じたいかなる損害についても、一切責任を負いません。</li>
        <li>作者は、利用者の本ソフトウェアの利用環境について一切関与せず、また一切の責任を負いません。</li>
        <li>作者は、本ソフトウェアが利用者の特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、利用者による本ソフトウェアの利用が利用者に適用のある法令または業界団体の内部規則等に適合すること、および不具合が生じないことについて、何ら保証するものではありません。</li>
        <li>作者は、本ソフトウェアが全ての情報端末に対応していることを保証するものではなく、本ソフトウェアの利用に供する情報端末のＯＳのバージョンアップ等に伴い、本ソフトウェアの動作に不具合が生じる可能性があることにつき、利用者はあらかじめ了承するものとします。作者は、かかる不具合が生じた場合に作者が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。</li>
        <li>利用者は、AppStore、GooglePlay等のサービスストアの利用規約および運用方針の変更等に伴い、本ソフトウェアの一部又は全部の利用が制限される可能性があることをあらかじめ了承するものとします。</li>
        <li>作者は、本ソフトウェアを利用したことにより直接的または間接的に利用者に発生した損害について、一切賠償責任を負いません。</li>
        <li>作者は、利用者その他の第三者に発生した機会逸失、業務の中断その他いかなる損害（間接損害や逸失利益を含みます）に対して、作者が係る損害の可能性を事前に通知されていたとしても、一切の責任を負いません。</li>
        <li>第１項乃至前項の規定は、作者に故意または重過失が存する場合又は契約書が消費者契約法上の消費者に該当する場合には適用しません。</li>
        <li>前項が適用される場合であっても、作者は、過失（重過失を除きます。）による行為によって利用者に生じた損害のうち、特別な事情から生じた損害については、一切賠償する責任を負わないものとします。</li>
        <li>本ソフトウェアの利用に関し作者が損害賠償責任を負う場合、当該損害が発生した月に利用者から受領した利用額を限度として賠償責任を負うものとします。</li>
        <li>利用者と他の利用者との間の紛争及びトラブルについて、作者は一切責任を負わないものとします。利用者と他の利用者でトラブルになった場合でも、両者同士の責任で解決するものとし、作者には一切の請求をしないものとします。</li>
        <li>利用者は、本ソフトウェアの利用に関連し、他の利用者に損害を与えた場合または第三者との間に紛争を生じた場合、自己の費用と責任において、かかる損害を賠償またはかかる紛争を解決するものとし、作者には一切の迷惑や損害を与えないものとします。</li>
        <li>利用者の行為により、第三者から作者が損害賠償等の請求をされた場合には、利用者の費用（弁護士費用）と責任で、これを解決するものとします。作者が、当該第三者に対して、損害賠償金を支払った場合には、利用者は、作者に対して当該損害賠償金を含む一切の費用（弁護士費用及び逸失利益を含む）を支払うものとします。</li>
        <li>利用者が本ソフトウェアの利用に関連して作者に損害を与えた場合、利用者の費用と責任において作者に対して損害を賠償（訴訟費用及び弁護士費用を含む）するものとします。</li>
      </ol>

      <h2>第６条（権利譲渡の禁止）</h2>
      <ol>
        <li>利用者は、予め作者の書面による承諾がない限り、本規約上の地位および本規約に基づく権利または義務の全部または一部を第三者に譲渡してはならないものとします。</li>
        <li>作者は、本ソフトウェアの全部または一部を作者の裁量により第三者に譲渡することができ、その場合、譲渡された権利の範囲内で利用者のアカウントを含む、本ソフトウェアに係る利用者の一切の権利が譲渡先に移転するものとします。</li>
      </ol>

      <h2>第７条（分離可能性）</h2>
      <p>
        本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効又は執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。
      </p>

      <h2>第８条（作者への連絡方法）</h2>
      <p>
        本ソフトウェアに関する利用者の作者へのご連絡・お問い合わせは、作者の<a target="_blank" href="https://twitter.com/CivilT_T" class="a">Twitterアカウント</a>に対するダイレクトメッセージまたは作者が別途指定する方法により行うものとします。
      </p>

      <h2>第９条（準拠法、管轄裁判所）</h2>
      <ol>
        <li>本規約の有効性，解釈及び履行については，日本法に準拠し，日本法に従って解釈されるものとする。</li>
        <li>本規約に関して作者と利用者等との間での論議・訴訟その他一切の紛争については、訴額に応じて、東京簡易裁判所又は東京地方裁判所を第一審の専属的合意管轄裁判所とします｡</li>
      </ol>

      <h3>２０２１年８月１９日　施行</h3>

    </q-card-section>
  </q-card>
</template>