<template>
  <q-card flat style="max-width: 100%;">
    <q-card-section>
      <h1>設定項目</h1>
      <p>
        各ルーターやセキュリティソフトごとに細かい設定内容や説明文の表現方法が異なりますので、ここでは一般的な設定項目について示します
        詳細な設定方法については各メーカーの取扱説明書をご参照下さい。
      </p>
      <ol>
        <li>ルーターやセキュリティソフトの設定画面を開く</li>
        <li>「ファイアウォール」や「セキュリティー」の設定画面を開く</li>
        <li>「ルールの追加」や「ポートの追加」を開く</li>
        <li>各設定項目を次のように設定する</li>
        <ul>
          <li>外部からのアクセス　（全てのPCに対して）許可</li>
          <li>ポートの種類　TCP</li>
          <li>LAN側IPアドレス　ServerStarterを起動し、システム設定のNetworkタブに記載されています</li>
          <li>ポート番号　　25565（-25565）</li>
        </ul>
        <li>設定を保存し、サーバーにほかの人がログインできれば設定終了</li>
        ※一人でポート開放の確認を行う場合は、サーバーが起動した後に<a href="https://www.cman.jp/network/support/port.html" class="a">株式会社シーマンが運営するこちらのHP</a>にアクセスすることで確認することができます
      </ol>
    </q-card-section>
  </q-card>
</template>