<template>
  <q-card flat style="max-width: 100%;">
    <q-card-section>
      <h1>プレイヤー</h1>
      Minecraft内でのユーザー名を登録します
      ここで登録しておいたプレイヤーは、各ワールド設定にてOp権限やホワイトリストの設定を行うことができます
      さらに、一括してプレイヤーをOpやホワイトリストに登録したい場合はそれらのプレイヤーを「グループ」として登録できます
      
      <h2>グループの登録方法</h2>
      <ol>
        <li>わかりやすいグループ名を「新規グループ名」に記入します</li>
        <li>「プレイヤー」の中からグループに登録したいプレイヤーを選択し、「追加」を押します</li>
        <li>登録したいプレイヤーがすべて「グループメンバー」に表示されたら「登録」を押します</li>
        <li>「登録済みグループ一覧」に登録内容が表示されればOK</li>
      </ol>

      <h2>既存グループのメンバー編集方法</h2>
      <ol>
        <li>「登録済みグループ一覧」より編集したいグループを選択します</li>
        <li>編集ボタンを押し、必要なメンバーの登録、削除を行います</li>
        <li>編集が終わり次第、「登録」を押すことで編集結果を登録できます</li>
      </ol>
    </q-card-section>
  </q-card>
</template>